app/controllers/orders_controller.rb

  def new
    @order = Order.find_by_id(session[:order_id])
---
SELECT * FROM "orders" WHERE ("orders"."id" IS NULL) LIMIT 1

  def confirm
    @order = Order.find_by_id(session[:order_id])
---
SELECT * FROM "orders" WHERE ("orders"."id" = 243) LIMIT 1

  def complete
    @order = Order.find_by_id(session[:order_id])

    purchase = GATEWAY.purchase(@order.paypal_amount,
      :ip => request.remote_ip,
      :payer_id => params[:payer_id],
      :token => params[:token]
    )

    unless purchase.success?
      @message = purchase.message
      render :action => 'error'
      return
    else
      # Save payer_id
      @order.express_payer_id = params[:payer_id]

      if (@order.event_order?)
        complete_event_order_and_redirect
        return
      end

      @order.complete = true
      @order.save
      session[:order_id] = nil

      user = @order.customer
      raise StandardError, "The object must be a User to continue" unless user.class == User

      if @order.order_items.first.item.name == "New Membership"
---
SELECT * FROM "events"